# _*_ coding : utf-8 _*_
# @Time : 2025/2/8 21:26
# @Author : 田园
# @File : 43-Python_函数的定义与调用
# @Project : readme.md

# 当有重复的逻辑重复地出现的情况下，为了避免代码冗余，可定义函数，并在需要时反复调用
# 应用场景：很多重复的业务逻辑，反复出现的时候，就可以使用函数
# 定义函数
def lyric():
    print('戏文说，相逢难逃别离，')
    print('姻缘断情难续，殷勤多是假意，')
    print('人心道不明，初听只当戏，再听已懂曲中意。')
    print('身着长衫轻摇纸扇，悲欢离合说一段，')
    print('听锣鼓声断台下看客几经轮换，')
    print('唯留余音婉转诉不清是曲难散，是情难断是命难算，还是此心难安，引人叹。')
    print('戏文说，红颜总是薄命，书生几番多情，')
    print('帝王身不由己，新词添旧曲，')
    print('幕落又幕起，唯有那看客清醒。')
# 调用函数
lyric()


